const student={
    name:'jahid',
    age:28,
    class:10,
    isMarried:false
}

const phone={
    brand:'samsung',
    price:8000,
    color: pink,
    version: 2.0
}

const juice={
    name:'Mango juse',
    price: 80,
    sugar:false
}

const car = {
    brand:'BMW',
    color: 'black',
    wheel:4,
    maxSpeed:100,
    ac:true
}

const subject= {
    name:'biology',
    teacher:'jahid',
    examDate:'20 Dec',
    chepters:['firs','second','thire'],
    nextExam:{
        name:'final Exam',
        marks: 100
    }
}


// 1. তূই teacher নামে একটি অবজেক্ট বান। এইটার মধ্যে টিচারের নাম থাকবে। উনি কোন সাবজেক্ট পড়ান, সেটার নাম থাকবে; সারের বয়স, বাসা কোথায়—এই টাইপের পাঁচটা জিনিস থাকবে।
// 2. গছ (tree) নামে একটি object তৈরি কর, যার মধ্যে থাকবে, এইটা কী গাছ, উচ্চতা কেমন, বয়স কত, ফলের নাম কী ইত্যাদি।
// 3.  তোর আশেপাশে কোনো প্রাণী থাকলে (গরু, বিড়াল, কুকুর, ইঁদুর, তেলাপোকা, মশা, মাছি, পিঁপড়া, টিকটিকি, মানুষ বা অন্য কোনো প্রাণী থাকলে), সেটার জন্য একটি অবজেক্ট লিখে ফেল।
// 4. তোর আব্বুর জন্য father নামে একটি অবজেক্ট বানিয়ে ফেল। সেখানে উনার নাম, পেশা, বয়স, সন্তানের সংখ্যা ইত্যাদি তথ্য দিয়ে ফেল।
// 5. একটি বাইক (motorbike) নিয়ে object বানা। সেখানে ব্র্যান্ডের নাম, টায়ারের সংখ্যা, রং, সর্বোচ্চ গতি আর দাম থাকবে।
// 6.  একটি পাখি (bird) অবজেক্ট তৈরি কর, যেখানে পাখির নাম, রং, খাদ্য ইত্যাদি প্রপার্টি থাকবে।"**
// 7.  একটি laptop অবজেক্ট তৈরি কর, যেখানে থাকবে ব্র্যান্ডের নাম, প্রসেসর, র‍্যাম, দাম, আর ডিসপ্লের সাইজ ইত্যাদি ডাট থাকবে। 



// 1. তূই teacher নামে একটি অবজেক্ট বান। এইটার মধ্যে টিচারের নাম থাকবে। উনি কোন সাবজেক্ট পড়ান, সেটার নাম থাকবে; সারের বয়স, বাসা কোথায়—এই টাইপের পাঁচটা জিনিস থাকবে।

const teacher={
    name:'Hasan',
    subject:'CEE',
    depertment:'SWE',
    age:34,
    classTime:'8:30 am'
}


// 2. গছ (tree) নামে একটি object তৈরি কর, যার মধ্যে থাকবে, এইটা কী গাছ, উচ্চতা কেমন, বয়স কত, ফলের নাম কী ইত্যাদি।
const tree={
    name: 'Mango Tree',
    height:'200 fit',
    age:40,
    fruitName:'Mango',
    taste:'Sweet'
}


// 3.  তোর আশেপাশে কোনো প্রাণী থাকলে (গরু, বিড়াল, কুকুর, ইঁদুর, তেলাপোকা, মশা, মাছি, পিঁপড়া, টিকটিকি, মানুষ বা অন্য কোনো প্রাণী থাকলে), সেটার জন্য একটি অবজেক্ট লিখে ফেল।
const animal={
    name: 'cat',
    color:'white',
    age:10,
    leg:4,
    food:'catfood'
}


// 4. তোর আব্বুর জন্য father নামে একটি অবজেক্ট বানিয়ে ফেল। সেখানে উনার নাম, পেশা, বয়স, সন্তানের সংখ্যা ইত্যাদি তথ্য দিয়ে ফেল।
const father={
    name:'Islam',
    occupation:'farmer',
    age:74,
    child:3,
}


// 5. একটি বাইক (motorbike) নিয়ে object বানা। সেখানে ব্র্যান্ডের নাম, টায়ারের সংখ্যা, রং, সর্বোচ্চ গতি আর দাম থাকবে।
const motorBike={
    brand:'sugaki',
    tire:2,
    color:'white',
    speed:160,
    price:180000
}


// 6.  একটি পাখি (bird) অবজেক্ট তৈরি কর, যেখানে পাখির নাম, রং, খাদ্য ইত্যাদি প্রপার্টি থাকবে।"**
const bird={
    name:'crow', 
    color: 'black',
    food: 'rice'
}


// 7.  একটি laptop অবজেক্ট তৈরি কর, যেখানে থাকবে ব্র্যান্ডের নাম, প্রসেসর, র‍্যাম, দাম, আর ডিসপ্লের সাইজ ইত্যাদি ডাট থাকবে। 
const laptop={
    brand:'HP', 
    processor:'I3 10gen',
    ram:8,
    display:'1900px'
}