let number= [12,350,654,15,94,46];
for ( num of number){
    console.log(num);
}


let fruits = ['banana', 'apple','mango', 'orange','painapple'];
for(item of fruits){
    console.log(item);
}




// 1. তুই 5টা পছন্দের সাবজেক্টের নাম লেখ। তারপর প্রোগ্রাম লিখে দেখ, কীভাবে লুপ ব্যবহার করে সব সাবজেক্টের নাম আলাদাভাবে প্রিন্ট হবে।
// 2. তোর একদম পছন্দের খাবার গুলোর নাম লেখ। এখন লুপ ব্যবহার করে প্রোগ্রাম লিখে দেখ, কীভাবে সব খাবারের নাম আলাদা আলাদা প্রিন্ট হবে।
// 3. একটি অ্যারের মধ্যে তোর ফ্যামিলি মেম্বারদের জন্মসাল লিখে ফেল। তারপর লুপ চালিয়ে সবার জন্মসাল আউটপুট হিসেবে দেখাবি।
// 4. ক্রিকেট বা ফুটবল খেলায় তোর প্রিয় একাদশের একটি টিম বানিয়ে তোর প্রিয় খেলোয়াড়দের নাম একটি অ্যারের মধ্যে রাখ। তারপর কনসোল লুপ করে সব খেলোয়াড়দের নাম আউটপুট হিসেবে দেখাবি।
// 5. নেক্সট কবে কবে তোর পরীক্ষা আছে, সেই তারিখগুলো অ্যারের মধ্যে লিখে ফেল। তারপর লুপ ব্যবহার করে পরীক্ষার তারিখগুলো কনসোল লপ কর।



// 1. তুই 5টা পছন্দের সাবজেক্টের নাম লেখ। তারপর প্রোগ্রাম লিখে দেখ, কীভাবে লুপ ব্যবহার করে সব সাবজেক্টের নাম আলাদাভাবে প্রিন্ট হবে।
let subjects =['bangla', 'english', 'math','Giography', 'science'];
for (subject of subjects){
    console.log(subject);
}



// 2. তোর একদম পছন্দের খাবার গুলোর নাম লেখ। এখন লুপ ব্যবহার করে প্রোগ্রাম লিখে দেখ, কীভাবে সব খাবারের নাম আলাদা আলাদা প্রিন্ট হবে।
let foods =['Morogpolaw', 'kachi', 'sorishailish','tehiryl', 'mutton'];
for (food of foods){
    console.log(food);
}


// 3. একটি অ্যারের মধ্যে তোর ফ্যামিলি মেম্বারদের জন্মসাল লিখে ফেল। তারপর লুপ চালিয়ে সবার জন্মসাল আউটপুট হিসেবে দেখাবি।
let birthYears= [1955,1962,1980,1992,1996];
for (year of birthYears){
    console.log(year);
}


// 4. ক্রিকেট বা ফুটবল খেলায় তোর প্রিয় একাদশের একটি টিম বানিয়ে তোর প্রিয় খেলোয়াড়দের নাম একটি অ্যারের মধ্যে রাখ। তারপর কনসোল লুপ করে সব খেলোয়াড়দের নাম আউটপুট হিসেবে দেখাবি।

let cricketPlayer =[
    'HasimAmla',
    'Musfiquer',
    'Mashrafi',
    'Tanjin',
    'Rofiq',
    'Bulbul',
    'Mustafij',
    'Mahmudullah',
    'Taijul',
    'Ashraful',
    'Aftab'
    ];
for(player of cricketPlayer){
    console.log(player);
}



// 5. নেক্সট কবে কবে তোর পরীক্ষা আছে, সেই তারিখগুলো অ্যারের মধ্যে লিখে ফেল। তারপর লুপ ব্যবহার করে পরীক্ষার তারিখগুলো কনসোল লপ কর।
let examDades =['June-25', 'june-28', 'july-3', 'july-6','july-8'];
for (examdate of examDades){
    console.log(examdate);
}